validationTestCases/Segerson-canopy/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is an attempt to make my own single building flow case

convertToMeters 1;

vertices
(
    (0       0    0)
    (1000    0    0)
	(1000  150    0)
	(0     150    0)
	(0       0  200)
    (1000    0  200)
	(1000  150  200)
	(0     150  200)
);

// 10 m x 10 m x 0.5 m resolution
// nx = Lx/dx = 1000 m /  10 m = 100
// ny = Ly/dy =  150 m /  10 m =  15
// nz = Lz/dz =  200 m / 0.5 m = 400
// ncells = nx*ny*nz = 100*15*400 = 600,000 cells
nxBlock 100;
nyBlock  15;
nzBlock 400;

blocks
(
	hex (0 1 2 3 4 5 6 7) ($nxBlock $nyBlock $nzBlock) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	xMax
	{
		type patch;
		faces
		(
			(1 2  6 5)
		);
	}
	yMin
	{
		type patch;
		faces
		(
			(0 4 5 1)
		);
	}
	yMax
	{
		type patch;
		faces
		(
			(2 6 7 3)
		);
	}

	zMax
	{
		type patch;
		faces
		(
			(4 7 6 5)
		);
	}

	ground
	{
		type wall;
		faces
		(
			(0 1 2 3)
		);
	}
);

// ************************************************************************* //
