validationTestCases/Segerson-canopy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (6.17 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    xMin
    {
        type                    logProfileVelocityInlet;
        UfreeStream             6.17;
        uDirection              (1 0 0);
        inputWindHeight_Veg     15;
        z0                      0.06;
        Rd                      0;
        firstCellHeight         0.5;    // dz
    }
    xMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMin
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
		type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
