validationTestCases/Segerson-canopy/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Cmu^0.75 * k^1.5 / L, where Cmu = 0.09, and L = 10. In my case k = 0.6997 to 0.6998 for the entire inlet domain edge. The average value is 0.69975
// formula seen in Wind Around Buildings tutorial, explained here: https://cfd.direct/openfoam/user-guide/v9-cavity/#x5-340002.1.8
epsilonInlet  0.00961825402;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{

    xMin
    {
        type                    logProfileDissipationRateInlet;
        UfreeStream             6.17;
        uDirection              (1 0 0);
        inputWindHeight_Veg     15;
        z0                      0.06;
        Rd                      0;
        firstCellHeight         0.5;    // dz
    }
    xMax
    {
        type            zeroGradient;
    }
    yMin
    {
        type            zeroGradient;
    }
	yMax
    {
        type            zeroGradient;
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
        type            myEpsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform $epsilonInlet;
    }
    
}


// ************************************************************************* //
