validationTestCases/Segerson-canopy/system/setFieldsDict_singleLAD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
);

regions
(

	// canopy region
	boxToCell
    {
        box (300 0 0) (1000 150 7.5);
        fieldValues
        (
            volScalarFieldValue  Cd 0.2
            volScalarFieldValue LAD 1.2     // representative of LAD_max
        );
    }

);


// ************************************************************************* //
